"""
1) Продемонструвати, що екземпляри reference type дійсно передаються за посиланням,
а value types - за значеннями (наприклад, як було на лекції)
"""

"""
Передача посилання для посилальних типів даних (reference types):
"""
# Створюємо початковий список
list1 = [1, 2, 3]


# Функція, яка додає елемент до списку
def add_element(lst):
    lst.append(4)


# Виклик функції і передача списку
add_element(list1)

# Виведення списку
print(list1)  # Виведе: [1, 2, 3, 4]
"""
У цьому прикладі ми передаємо список list1 в функцію add_element(). 
Функція додає елемент до цього списку, і зміни відображаються в 
оригінальному списку list1. Це тому, що ми передали посилання на 
список, а не його копію.
"""

"""
Передача значення для значимих типів даних (value types):
"""
# Створення змінної
x = 5


# Функція, яка змінює значення числа
def change_number(num):
    num = 10


# Виклик функції і передача змінної
change_number(x)

# Виведення змінної
print(x)  # Виведе: 5
"""
У цьому прикладі ми передаємо змінну x в функцію change_number(). 
Функція змінює значення цієї змінної на 10, але зміни не відображаються 
в оригінальній змінній x. Це тому, що ми передали копію значення змінної, 
а не саму змінну за посиланням.

Таким чином, ці приклади демонструють, що посилальні типи даних передаються 
за посиланням, тоді як значимі типи даних передаються за значенням.
"""