"""
2) Продемонструвати як створити об'єкт на стеку, а як на хіпі
"""

"""
У Python всі об'єкти створюються на купі (heap), незалежно від того, як ви їх створюєте. 
Стек (stack) використовується для управління фреймами виклику функцій та зберігання 
локальних змінних функцій. Проте самі об'єкти зберігаються на купі.

Отже, немає прямого способу створення об'єктів на стеці в Python, оскільки це вирішується 
автоматично рівнянням сміття. Об'єкти, які більше не мають посилань на них, звільняються 
сбиральником сміття, а пам'ять відновлюється.

Отже, весь процес створення і керування об'єктами відбувається на купі (heap) в Python, 
а стек (stack) використовується для управління фреймами виклику функцій та зберігання 
локальних змінних функцій.
"""

