"""
3) Продемонструвати роботу garbage collector в обраній мові, якщо він є
"""

"""
Зазвичай пайтон сам усе очищає та контролює

Давайте продемонструємо це на прикладі:
"""
import psutil


# Функція, яка поглинає пам'ять
def consume_memory():
    data = []
    for j in range(5):
        # Отримання інформації про використання пам'яті
        memory = psutil.virtual_memory()
        # Виведення даних про використання пам'яті
        print(f"{j + 1}) Використано пам'яті:", round(memory.used / (1024 ** 3), 2), "Gb")
        for i in range(100000000):
            data.append(' ' * 1024)  # Додаємо 1 КБ даних у список


# Виклик функції, яка поглинає пам'ять
consume_memory()
# Отримання інформації про використання пам'яті
memory = psutil.virtual_memory()
# Виведення даних про використання пам'яті
print(f"\nEND) Використано пам'яті:", round(memory.used / (1024 ** 3), 2), "Gb")
