"""
4) Продемонструвати одне з явищ на вибір: memory leak, heavy memory consumption, memory fragmentation
"""

"""
З допомогою Python можна продемонструвати явище поглинання пам'яті (heavy memory consumption). 
Поглинання пам'яті виникає, коли програма використовує все більше і більше пам'яті під час 
своєї роботи, а не вивільняє її, що може призвести до вичерпання ресурсів пам'яті на системі.

Ось приклад, який демонструє поглинання пам'яті:
"""
import psutil


# Функція, яка поглинає пам'ять
def consume_memory():
    data = []
    for j in range(5):
        # Отримання інформації про використання пам'яті
        memory = psutil.virtual_memory()
        # Виведення даних про використання пам'яті
        print(f"{j + 1}) Використано пам'яті:", round(memory.used / (1024 ** 3), 2), "Gb")
        for i in range(50000000):
            data.append(' ' * 1024)  # Додаємо 1 КБ даних у список


# Виклик функції, яка поглинає пам'ять
consume_memory()
